src/cf/InformationRegisters/ИдентификаторыСинхронизуемыхОбъектовМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыСинхронизуемыхОбъектовМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДСМП</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницыМП</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиМП</v8:Type>
						<v8:Type>cfg:CatalogRef.КассыККММП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторНаЦентральномУзле</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторНаКлиентскомУзле</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ИдентификаторыСинхронизуемыхОбъектовМП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьСсылкуПоУникальномуИдентификаторуНаЦентральномУзле(УникальныйИдентификаторНаЦентральномУзле) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИдентификаторыСинхронизуемыхОбъектовМП.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.ИдентификаторыСинхронизуемыхОбъектовМП КАК ИдентификаторыСинхронизуемыхОбъектовМП
		|ГДЕ
		|	ИдентификаторыСинхронизуемыхОбъектовМП.ИдентификаторНаЦентральномУзле = &ИдентификаторНаЦентральномУзле";
	
	Запрос.УстановитьПараметр("ИдентификаторНаЦентральномУзле", УникальныйИдентификаторНаЦентральномУзле);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено
	
КонецФункции // ()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьЗапись(Структура) Экспорт
	
	НаборЗаписей = РегистрыСведений.ИдентификаторыСинхронизуемыхОбъектовМП.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ИдентификаторНаКлиентскомУзле.Установить(Структура.ИдентификаторНаКлиентскомУзле);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		НоваяЗапись = НаборЗаписей.Добавить();
		Для Каждого Элемент Из Структура Цикл
			НоваяЗапись[Элемент.Ключ] = Элемент.Значение;
		КонецЦикла;
		
	Иначе
		Для каждого ЗаписьНабора Из НаборЗаписей Цикл
			Для Каждого Элемент Из Структура Цикл
				ЗаписьНабора[Элемент.Ключ] = Элемент.Значение;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	НаборЗаписей.Записать();
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
